# Задача 2. В первом списке находится информация об ассортименте мороженного, 
# во втором списке - информация о том, какое мороженное есть на складе. 
# Выведите названия того товара, который закончился.

# Пример:
# 1 строка файла. «Сливочное», «Бурёнка», «Вафелька», «Сладкоежка»
# 2 строка файла. «Сливочное», «Вафелька», «Сладкоежка»
# Ответ. Закончилось: «Бурёнка»

in_assortment = ["Сливочное", "Бурёнка", "Вафелька", "Сладкоежка"]
in_stock = ["Сливочное", "Вафелька", "Сладкоежка"]

for ice_cream in in_assortment:
    if ice_cream not in in_stock:
        print("Закончилось:", ice_cream)
        break