# Задача 3. Выведите число π с заданной точностью. Точность выводится в виде десятичной дроби.
# 3 -> 3.142


import math

precision = int(input('С какой точностью вывести число π (введите количество знаков после запятой):'))
pi = round(math.pi, precision)

print(pi)